# 경영프로그래밍 2주차 2차시 예습

# 모두의 R 데이터분석 페이지 67~
# 7. R 프로젝트 생성

# R에서 데이터 분석 작업을 하려면 프로젝트(project)를 만드는 것이 좋다.
# R 프로젝트는 분석 주제와 관련한 파일을 모아 놓은 그룹과 같다. 
# 프로젝트를 만들면 그와 관련한 소스 파일, 문서, 이미지 등을 관리하기가 쉬워진다. 
# 새 프로젝트를 만들어보자. 

# 1) 새 프로젝트를 만들려면 RStudio에서 File > New Project를 선택한다.
# 오른쪽 위에 있는 Project: (None) > New Project를 선택해도 된다.
# 2) New Project Wizard 창의 Create Project > New Directory를 선택한다.
# 3) Project Type > New Project를 선택한다.
# 4) Create New Project에서 프로젝트 디렉터리 이름과 서브 디렉터리의 위치를 정한다.
# 5) practice_project라는 프로젝트 디렉터리를 만들었다. 
# 프로젝트 디렉터리 이름과 프로젝트 디렉터리 위치가 앞서 설정한 이름과 위치로 정해진 것을 볼 수 있다.
# 6) (플로피디스크 2개가 합쳐진 모양의) 아이콘을 클릭하여 소스 창을 연다.
# 윈도우 탐색기로 확인해보면 해당 프로젝트는 실제로 디스크의 지정된 위치에 만들어 졌고, 
# 프로젝트 파일(practice_project)도 만들어진 것을 확인할 수 있다.
